---------------------------------------------------------------------------------------------------
TYCHE[0](0x1507678)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)

---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------
TYCHE[0](0x1574a80)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")

TYCHE[0](0x1574b58)(Coerced: 0)(FAM: 0) = [0..4] = <0x1574b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x156d148> = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: <0x1574a80>, file: <0x14f4088>, line: 39, baseType: <0x1574b58>, size: 32)

TYCHE[8](0x14e2128)(Coerced: 0)(FAM: 0) = [8..20] = <0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)
	<0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x156d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x1574b00>, file: <0x14f4088>, line: 34, baseType: <0x1574be0>, size: 96)
	<0x1574be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x14e2128>, size: 96, elements: <0x1574e98>)

TYCHE[8](0x1574b00)(Coerced: 0)(FAM: 0) = [8..32] = <0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)

TYCHE[12](0x14e2128)(Coerced: 0)(FAM: 0) = [8..20] = <0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)
	<0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x156d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x1574b00>, file: <0x14f4088>, line: 34, baseType: <0x1574be0>, size: 96)
	<0x1574be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x14e2128>, size: 96, elements: <0x1574e98>)

TYCHE[16](0x14e2128)(Coerced: 0)(FAM: 0) = [8..20] = <0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)
	<0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x156d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x1574b00>, file: <0x14f4088>, line: 34, baseType: <0x1574be0>, size: 96)
	<0x1574be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x14e2128>, size: 96, elements: <0x1574e98>)

TYCHE[24](0x156cee8)(Coerced: 1)(FAM: 0) = [24..32] = <0x156cee8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1507678>, size: 64)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)
	<0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x156cc88> = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: <0x1574b00>, file: <0x14f4088>, line: 35, baseType: <0x156cee8>, size: 64, offset: 128)

TYCHE[24](0x156cee8)(Coerced: 0)(FAM: 0) = [24..32] = <0x156cee8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1507678>, size: 64)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x1574a80>, file: <0x14f4088>, line: 40, baseType: <0x1574b00>, size: 192, offset: 64)
	<0x1574b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x14f4088>, line: 33, size: 192, elements: <0x15076d0>, identifier: "_ZTS1T")
	<0x156cc88> = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: <0x1574b00>, file: <0x14f4088>, line: 35, baseType: <0x156cee8>, size: 64, offset: 128)

TYCHE[32](0x1575320)(Coerced: 0)(FAM: 0) = [32..48] = <0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)

TYCHE[32](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[32](0x15754d8)(Coerced: 0)(FAM: 0) = [32..40] = <0x15754d8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1575468>, size: 64)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575548> = !DIDerivedType(tag: DW_TAG_member, name: "d_pointer", scope: <0x1575320>, file: <0x14f4088>, line: 29, baseType: <0x15754d8>, size: 64)

TYCHE[32](0x15754d8)(Coerced: 1)(FAM: 0) = [32..40] = <0x15754d8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1575468>, size: 64)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575548> = !DIDerivedType(tag: DW_TAG_member, name: "d_pointer", scope: <0x1575320>, file: <0x14f4088>, line: 29, baseType: <0x15754d8>, size: 64)

TYCHE[33](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[34](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[35](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[36](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[37](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[38](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[39](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[40](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[41](0x1507678)(Coerced: 0)(FAM: 0) = [32..42] = <0x1507678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x15755e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x1574a80>, file: <0x14f4088>, line: 41, baseType: <0x1575320>, size: 128, offset: 256)
	<0x1575320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x14f4088>, line: 26, size: 128, elements: <0x15755a0>, identifier: "_ZTS5Union")
	<0x1575408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x1575320>, file: <0x14f4088>, line: 28, baseType: <0x15753a0>, size: 80)
	<0x15753a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x1507678>, size: 80, elements: <0x15076f8>)

TYCHE[48](0x14e2128)(Coerced: 0)(FAM: 0) = [48..52] = <0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575cd8> = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: <0x1574a80>, file: <0x14f4088>, line: 42, baseType: <0x1575c70>, size: 32, offset: 384)

TYCHE[52](0x1574b58)(Coerced: 0)(FAM: 1) = [-17179869132..17179869236] = <0x1574b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
	<0x1574a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x14f4088>, line: 38, size: 448, elements: <0x1575e98>, identifier: "_ZTS1S")
	<0x1575e28> = !DIDerivedType(tag: DW_TAG_member, name: "fam_float", scope: <0x1574a80>, file: <0x14f4088>, line: 43, baseType: <0x1575dc0>, offset: 416)

---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------
TYCHE[0](0x1575468)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x1575468> = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
	<0x1575468> = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)

---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------
TYCHE[0](0x14e2128)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x14e2128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)

---------------------------------------------------------------------------------------------------
TID(0)= 0[1]{1}	1.000000 0 0 1
TID(1)= 0[1]{8}	32[2]{14}{1}	1.500000 1 653 23
TID(2)= 0[1]{1}	1.000000 0 0 1
TID(3)= 0[1]{1}	1.000000 0 0 1
SECTION[0] OFFSET[0] = TID(0) Size(15) <== Filled
SECTION[1] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[2] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[3] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[4] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[5] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[6] OFFSET[0] = TID(0) Size(15) <== Empty
SECTION[7] OFFSET[0] = TID(0) Size(15) <== Empty
------------------------------------------------------------------------------------------
SECTION[0] OFFSET[0] = TID(1) Size(15) <== Filled
SECTION[1] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[2] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[3] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[4] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[5] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[6] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[7] OFFSET[0] = TID(1) Size(15) <== Empty
SECTION[1] OFFSET[1] = TID(1) Size(15) <== Filled
SECTION[0] OFFSET[1] = TID(1) Size(15) <== Filled
SECTION[2] OFFSET[1] = TID(1) Size(15) <== Empty
SECTION[3] OFFSET[1] = TID(1) Size(15) <== Empty
SECTION[4] OFFSET[1] = TID(1) Size(15) <== Empty
SECTION[5] OFFSET[1] = TID(1) Size(15) <== Empty
SECTION[6] OFFSET[1] = TID(1) Size(15) <== Empty
SECTION[7] OFFSET[1] = TID(1) Size(15) <== Empty
------------------------------------------------------------------------------------------
SECTION[0] OFFSET[0] = TID(2) Size(15) <== Filled
SECTION[1] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[2] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[3] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[4] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[5] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[6] OFFSET[0] = TID(2) Size(15) <== Empty
SECTION[7] OFFSET[0] = TID(2) Size(15) <== Empty
------------------------------------------------------------------------------------------
SECTION[0] OFFSET[0] = TID(3) Size(15) <== Filled
SECTION[1] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[2] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[3] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[4] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[5] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[6] OFFSET[0] = TID(3) Size(15) <== Empty
SECTION[7] OFFSET[0] = TID(3) Size(15) <== Empty
------------------------------------------------------------------------------------------
