	int8_t [+0] (-17179869184..17179869184) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
---------------------------------------------------------------------------------------------------
TYCHE[0](0x2337678)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)

---------------------------------------------------------------------------------------------------
	struct S [+0] (-17179869184..17179869184) <9F98FFE3513D7C10> {-6946521073433347056} <0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
struct S:
	float32_t [+0] (0..4) <2DC2E09F79C2D46B> {3297444852735857771} <0x23a4b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	struct T [+8] (0..24) <8561340DB8E3F160> {-8835723760383037088} <0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	int32_t [+8] (0..12) <6AF442D6B0174042> {7706858352182509634} <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)
	int32_t [+12] (-4..8) <6AF442D6B0174042> {7706858352182509634} <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)
	int32_t [+16] (-8..4) <6AF442D6B0174042> {7706858352182509634} <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)
	int8_t * [+24] (0..8) <8D0DECDF6C6A8711> {-8282703695323691247} <0x239cee8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x2337678>, size: 64)
<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	+coerced <2317E969C295951D> {2528746356237243677}
	union Union [+32] (0..16) <DB16A514AB54353F> {-2659757021723347649} <0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	int8_t [+32] (0..10) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+33] (-1..9) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+34] (-2..8) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+35] (-3..7) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+36] (-4..6) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+37] (-5..5) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+38] (-6..4) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+39] (-7..3) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+40] (-8..2) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	int8_t [+41] (-9..1) <703EDF97BC60677D> {8088147823597479805} <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)
	float64_t * [+32] (0..8) <679E568F7EB435B9> {7466500406532912569} <0x23a54d8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x23a5468>, size: 64)
<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	+coerced <2317E969C295951D> {2528746356237243677}
	int32_t [+48] (0..4) <6AF442D6B0174042> {7706858352182509634} <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	float32_t [+52] (-17179869184..17179869184) <2DC2E09F79C2D46B> {3297444852735857771} <0x23a4b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")

---------------------------------------------------------------------------------------------------
TYCHE[0](0x23a4a80)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")

TYCHE[0](0x23a4b58)(Coerced: 0)(FAM: 0) = [0..4] = <0x23a4b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x239d148> = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: <0x23a4a80>, file: <0x2324088>, line: 39, baseType: <0x23a4b58>, size: 32)

TYCHE[8](0x2312128)(Coerced: 0)(FAM: 0) = [8..20] = <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)
	<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x239d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x23a4b00>, file: <0x2324088>, line: 34, baseType: <0x23a4be0>, size: 96)
	<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)

TYCHE[8](0x23a4b00)(Coerced: 0)(FAM: 0) = [8..32] = <0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)

TYCHE[12](0x2312128)(Coerced: 0)(FAM: 0) = [8..20] = <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)
	<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x239d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x23a4b00>, file: <0x2324088>, line: 34, baseType: <0x23a4be0>, size: 96)
	<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)

TYCHE[16](0x2312128)(Coerced: 0)(FAM: 0) = [8..20] = <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)
	<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x239d088> = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: <0x23a4b00>, file: <0x2324088>, line: 34, baseType: <0x23a4be0>, size: 96)
	<0x23a4be0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2312128>, size: 96, elements: <0x23a4e98>)

TYCHE[24](0x239cee8)(Coerced: 1)(FAM: 0) = [24..32] = <0x239cee8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x2337678>, size: 64)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)
	<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x239cc88> = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: <0x23a4b00>, file: <0x2324088>, line: 35, baseType: <0x239cee8>, size: 64, offset: 128)

TYCHE[24](0x239cee8)(Coerced: 0)(FAM: 0) = [24..32] = <0x239cee8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x2337678>, size: 64)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5298> = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: <0x23a4a80>, file: <0x2324088>, line: 40, baseType: <0x23a4b00>, size: 192, offset: 64)
	<0x23a4b00> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "T", file: <0x2324088>, line: 33, size: 192, elements: <0x23376d0>, identifier: "_ZTS1T")
	<0x239cc88> = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: <0x23a4b00>, file: <0x2324088>, line: 35, baseType: <0x239cee8>, size: 64, offset: 128)

TYCHE[32](0x23a5320)(Coerced: 0)(FAM: 0) = [32..48] = <0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)

TYCHE[32](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[32](0x23a54d8)(Coerced: 0)(FAM: 0) = [32..40] = <0x23a54d8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x23a5468>, size: 64)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5548> = !DIDerivedType(tag: DW_TAG_member, name: "d_pointer", scope: <0x23a5320>, file: <0x2324088>, line: 29, baseType: <0x23a54d8>, size: 64)

TYCHE[32](0x23a54d8)(Coerced: 1)(FAM: 0) = [32..40] = <0x23a54d8> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x23a5468>, size: 64)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5548> = !DIDerivedType(tag: DW_TAG_member, name: "d_pointer", scope: <0x23a5320>, file: <0x2324088>, line: 29, baseType: <0x23a54d8>, size: 64)

TYCHE[33](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[34](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[35](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[36](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[37](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[38](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[39](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[40](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[41](0x2337678)(Coerced: 0)(FAM: 0) = [32..42] = <0x2337678> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a55e8> = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: <0x23a4a80>, file: <0x2324088>, line: 41, baseType: <0x23a5320>, size: 128, offset: 256)
	<0x23a5320> = distinct !DICompositeType(tag: DW_TAG_union_type, name: "Union", file: <0x2324088>, line: 26, size: 128, elements: <0x23a55a0>, identifier: "_ZTS5Union")
	<0x23a5408> = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: <0x23a5320>, file: <0x2324088>, line: 28, baseType: <0x23a53a0>, size: 80)
	<0x23a53a0> = !DICompositeType(tag: DW_TAG_array_type, baseType: <0x2337678>, size: 80, elements: <0x23376f8>)

TYCHE[48](0x2312128)(Coerced: 0)(FAM: 0) = [48..52] = <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5cd8> = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: <0x23a4a80>, file: <0x2324088>, line: 42, baseType: <0x23a5c70>, size: 32, offset: 384)

TYCHE[52](0x23a4b58)(Coerced: 0)(FAM: 1) = [-17179869132..17179869236] = <0x23a4b58> = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
	<0x23a4a80> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: <0x2324088>, line: 38, size: 448, elements: <0x23a5e98>, identifier: "_ZTS1S")
	<0x23a5e28> = !DIDerivedType(tag: DW_TAG_member, name: "fam_float", scope: <0x23a4a80>, file: <0x2324088>, line: 43, baseType: <0x23a5dc0>, offset: 416)

---------------------------------------------------------------------------------------------------
	float64_t [+0] (-17179869184..17179869184) <D0D406D8143D4D53> {-3399084293635617453} <0x23a5468> = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
---------------------------------------------------------------------------------------------------
TYCHE[0](0x23a5468)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x23a5468> = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
	<0x23a5468> = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)

---------------------------------------------------------------------------------------------------
	int32_t [+0] (-17179869184..17179869184) <6AF442D6B0174042> {7706858352182509634} <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
---------------------------------------------------------------------------------------------------
TYCHE[0](0x2312128)(Coerced: 0)(FAM: 0) = [-17179869184..17179869184] = <0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
	<0x2312128> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)

---------------------------------------------------------------------------------------------------
